In [1]:
import numpy as np
import pandas as pd

In [5]:
np.random.seed(101)

In [2]:
linhas = ['a','b','c','d','e']
linhas

['a', 'b', 'c', 'd', 'e']

In [3]:
colunas = ['w','x','y','z']
colunas

['w', 'x', 'y', 'z']

In [17]:
dataframe = pd.DataFrame(np.random.randn(5,4),linhas,colunas)
dataframe #dataframes são series em duas dimensões onde os indices arbitrarios podem ser tanto as linhas quanto as colunas

          w         x         y         z
a  0.586847 -1.621348  0.677535  0.026105
b -1.678284  0.333973 -0.532471  2.117727
c  0.197524  2.302987  0.729024 -0.863091
d  0.305632  0.243178  0.864165 -1.560931
e -0.251897 -0.578120  0.236996  0.200780

In [14]:
pd.DataFrame(np.random.randn(5,4),linhas) #somente os indices das linhas foram declarados

          0         1         2         3
a -1.467514 -0.494095 -0.162535  0.485809
b  0.392489  0.221491 -0.855196  1.541990
c  0.666319 -0.538235 -0.568581  1.407338
d  0.641806 -0.905100 -0.391157  1.028293
e -1.972605 -0.866885  0.720788 -1.223082

In [15]:
pd.DataFrame(np.random.randn(5,4),columns = colunas) #somente os indices das colunas foram declarados

          w         x         y         z
0  1.606780 -1.115710 -1.385379 -1.329660
1  0.041460 -0.411055 -0.771329  0.110477
2 -0.804652  0.253548  0.649148  0.358941
3 -1.080471  0.902398  0.161781  0.833029
4  0.975720 -0.388239  0.783316 -0.708954

In [20]:
#é possivel achar elementos num dataframe de 3 formas:
#1)
dataframe['w'] # retorna uma serie de todas linhas de W

a    0.586847
b   -1.678284
c    0.197524
d    0.305632
e   -0.251897
Name: w, dtype: float64

In [21]:
dataframe[['w','z','y']] # retorna uma serie de todas linhas de W z y

          w         z         y
a  0.586847  0.026105  0.677535
b -1.678284  2.117727 -0.532471
c  0.197524 -0.863091  0.729024
d  0.305632 -1.560931  0.864165
e -0.251897  0.200780  0.236996

In [22]:
dataframe[['w','z','y']] # retorna um dataframe de todas linhas das colunas W z e y

          w         z         y
a  0.586847  0.026105  0.677535
b -1.678284  2.117727 -0.532471
c  0.197524 -0.863091  0.729024
d  0.305632 -1.560931  0.864165
e -0.251897  0.200780  0.236996

In [27]:
dataframe['w']['a'] # retorna o elemento da linha a e coluna 2

0.586847295403904

In [28]:
dataframe['w'][['a','c']] #retorna uma serie das linhas a e c da coluna w

a    0.586847
c    0.197524
Name: w, dtype: float64

In [33]:
dataframe[['w','z']][['a','c']] # não é possivel fazer isso

KeyError: "None of [Index(['a', 'c'], dtype='object')] are in the [columns]"

In [36]:
#2) usando a função loc
dataframe.loc['w']  #retorna uma serie de todas linhas de W

w    0.586847
x   -1.621348
y    0.677535
z    0.026105
Name: a, dtype: float64

In [48]:
dataframe.loc[['a','b','c','d'],['w','y','z']] # retorna uma dataframe de todas linhas das colunas W z y
                                               # as linhas vem antes das coluans

          w         y         z
a  0.586847  0.677535  0.026105
b -1.678284 -0.532471  2.117727
c  0.197524  0.729024 -0.863091
d  0.305632  0.864165 -1.560931

In [50]:
dataframe.loc['a','z']# pega o elemento da linha a e coluna z

0.026105480322676483

In [54]:
#3) usando a função iloc
#funciona igual ao loc mas com indices numericos
dataframe.iloc[1]  #retorna uma serie de todas colunas da linha  de indice 1(b)

w   -1.678284
x    0.333973
y   -0.532471
z    2.117727
Name: b, dtype: float64

In [55]:
dataframe.iloc[1][0] #retorna  o elemento da linha 1[b] e coluna 0 [2]

-1.6782836579965759

In [68]:
dataframe.iloc[1:4,[0,1,3]] # retorna um dataframe das linhas 1:4[b c d] e colunas [0 1 3][w x z]
# vou usar só o loc

          w         x         z
b -1.678284  0.333973  2.117727
c  0.197524  2.302987 -0.863091
d  0.305632  0.243178 -1.560931

In [58]:
# adicionando colunaas
dataframe['nova_coluna'] = dataframe['w']*2
dataframe

          w         x         y         z  nova_coluna
a  0.586847 -1.621348  0.677535  0.026105     1.173695
b -1.678284  0.333973 -0.532471  2.117727    -3.356567
c  0.197524  2.302987  0.729024 -0.863091     0.395048
d  0.305632  0.243178  0.864165 -1.560931     0.611263
e -0.251897 -0.578120  0.236996  0.200780    -0.503794

In [63]:
# retirando  colunas
dataframe.drop('nova_coluna',axis=1)#se axis=0 ele vai procurar esse indice nas colunas

          w         x         y         z
a  0.586847 -1.621348  0.677535  0.026105
b -1.678284  0.333973 -0.532471  2.117727
c  0.197524  2.302987  0.729024 -0.863091
d  0.305632  0.243178  0.864165 -1.560931
e -0.251897 -0.578120  0.236996  0.200780

In [64]:
# retirando linhas
dataframe.drop('e',axis=0)
#obs: em ambos os casos a mudança só vai ser feita no dataframe se ele receber ele mesmo modificado ou se o argumento inplace=True

          w         x         y         z  nova_coluna
a  0.586847 -1.621348  0.677535  0.026105     1.173695
b -1.678284  0.333973 -0.532471  2.117727    -3.356567
c  0.197524  2.302987  0.729024 -0.863091     0.395048
d  0.305632  0.243178  0.864165 -1.560931     0.611263

In [72]:
from numpy.random import randn
np.random.seed(101)

In [73]:
df = pd.DataFrame(np.random.randn(5,4),linhas,colunas)
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [75]:
df>0 # retorna uma matriz onde os valores maiores que 0 retornam True

       w      x      y      z
a   True   True   True   True
b   True  False  False   True
c  False   True   True  False
d   True  False  False   True
e   True   True   True   True

In [76]:
bol = df>0

In [77]:
df[bol] # retorna os elementos de df que tinha um correspondete True no dataframe bol
        # os elementos que tinham um correspondete False retornam NaN

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118       NaN       NaN  0.605965
c       NaN  0.740122  0.528813       NaN
d  0.188695       NaN       NaN  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [78]:
df[df['w']>0]#exclui as linhas onde o valor de w era <=0 e retorna o resto do dataframe

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [79]:
df[df['w']>0]['y']#exclui as linhas onde o valor de w era <=0 e pega todos os elementos da coluna y

a    0.907969
b   -0.848077
d   -0.933237
e    2.605967
Name: y, dtype: float64

In [80]:
df[(df['w']>0) & (df['y']>1)] # pega só as linhas onde y>1 e w>0

          w         x         y         z
e  0.190794  1.978757  2.605967  0.683509

In [81]:
df[(df['w']>0) | (df['y']>1)] # pega só as linhas onde y>1 ou w>0

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [83]:
df.reset_index() # transforma o nome de kda linha em coluna e as linhas voltam a ter indices numericos
                 # pra essas mudanças valerem e necessário reatribuir df = df.reset_index ou o argumento inplace = True

  index         w         x         y         z
0     a  2.706850  0.628133  0.907969  0.503826
1     b  0.651118 -0.319318 -0.848077  0.605965
2     c -2.018168  0.740122  0.528813 -0.589001
3     d  0.188695 -0.758872 -0.933237  0.955057
4     e  0.190794  1.978757  2.605967  0.683509

In [88]:
 #criando nova coluna e colocando ela como index
c = 'est1 est2 est3 est4 est5'.split()
c

['est1', 'est2', 'est3', 'est4', 'est5']

In [89]:
df['novo_idex'] = c
df

          w         x         y         z novo_idex
a  2.706850  0.628133  0.907969  0.503826      est1
b  0.651118 -0.319318 -0.848077  0.605965      est2
c -2.018168  0.740122  0.528813 -0.589001      est3
d  0.188695 -0.758872 -0.933237  0.955057      est4
e  0.190794  1.978757  2.605967  0.683509      est5

In [95]:
df.set_index('novo_idex')# pra essas mudanças valerem e necessário reatribuir df = df.reset_index ou o argumento inplace = True

                  w         x         y         z
novo_idex
est1       2.706850  0.628133  0.907969  0.503826
est2       0.651118 -0.319318 -0.848077  0.605965
est3      -2.018168  0.740122  0.528813 -0.589001
est4       0.188695 -0.758872 -0.933237  0.955057
est5       0.190794  1.978757  2.605967  0.683509

In [96]:
#indice multinivel
outside = 'g1 g1 g1 g2 g2 g2'.split()
outside

['g1', 'g1', 'g1', 'g2', 'g2', 'g2']

In [97]:
inside = [1,2,3,1,2,3]
inside

[1, 2, 3, 1, 2, 3]

In [98]:
hier_index= list(zip(outside, inside))#cria uma tupla contendo kda elemento de mesmo indice em outide e inside
hier_index

[('g1', 1), ('g1', 2), ('g1', 3), ('g2', 1), ('g2', 2), ('g2', 3)]

In [99]:
hier_index = pd.MultiIndex.from_tuples(hier_index)
hier_index # transforma isso num index multinivel

MultiIndex([('g1', 1),
            ('g1', 2),
            ('g1', 3),
            ('g2', 1),
            ('g2', 2),
            ('g2', 3)],
           )

In [102]:
df = pd.DataFrame(randn(6,2), hier_index, 'a b'.split()) # cria um dataframe de index multinivel
df

             a         b
g1 1 -0.497104 -0.754070
   2 -0.943406  0.484752
   3 -0.116773  1.901755
g2 1  0.238127  1.996652
   2 -0.993263  0.196800
   3 -1.136645  0.000366

In [105]:
df.loc['g1'] #acessa os elementos do indice g1

          a         b
1 -0.497104 -0.754070
2 -0.943406  0.484752
3 -0.116773  1.901755

In [106]:
df.loc['g1'].loc[1] #acessa os elementos do indice 1 que está no indice g1

a   -0.497104
b   -0.754070
Name: 1, dtype: float64

In [115]:
df.loc['g1'].iloc[:]['b']#acessa os elementos da coluna b que está no indice g1

1   -0.754070
2    0.484752
3    1.901755
Name: b, dtype: float64

In [117]:
df.index.names

FrozenList([None, None])

In [118]:
df.index.names = ['grupo', 'numero']#atribui um nome a kda nivel do indice
df

                     a         b
grupo numero
g1    1      -0.497104 -0.754070
      2      -0.943406  0.484752
      3      -0.116773  1.901755
g2    1       0.238127  1.996652
      2      -0.993263  0.196800
      3      -1.136645  0.000366

In [119]:
df.xs("g1") # retorna todos os valores em g1

               a         b
numero
1      -0.497104 -0.754070
2      -0.943406  0.484752
3      -0.116773  1.901755

In [121]:
df.xs(1,level='numero') # retorna todos os valores em 1 tanto em g1 quanto em g2
        #por isso é bom nomear os niveis dos indices

              a         b
grupo
g1    -0.497104 -0.754070
g2     0.238127  1.996652

In [1]:
#dados ausentes

In [3]:
dicio = {'a':[1,2,np.nan],'b':[5,np.nan,np.nan],'c':[1,2,3]}

In [4]:
df = pd.DataFrame(dicio)
df

     a    b  c
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [5]:
df.dropna()# retira todas as  linhas ondem tem valores ausentes
           # inplace = False
           # axis = 0 (retira as linhas)

     a    b  c
0  1.0  5.0  1

In [6]:
df.dropna(axis=1)# retira todas colunas ondem tem valores ausentes

   c
0  1
1  2
2  3

In [14]:
df.dropna(thresh=2)# retira todas as  linhas ondem tem valores ausentes nas linhas onde existem 2 valores ausentes

     a    b  c
0  1.0  5.0  1
1  2.0  NaN  2

In [16]:
df.fillna(value=':)')# substitui os valores ausentes por :)

     a    b  c
0  1.0  5.0  1
1  2.0   :)  2
2   :)   :)  3

In [18]:
df.fillna(value=df.mean())# substitui os valores ausentes por pela media dos demais valores

     a    b  c
0  1.0  5.0  1
1  2.0  5.0  2
2  1.5  5.0  3

In [19]:
df['a'].fillna(value=df['a'].mean())
#substitui os valores ausentes na coluna a por pela media dos demais valores da mesma coluna

0    1.0
1    2.0
2    1.5
Name: a, dtype: float64

In [20]:
df.fillna(method='ffill') #subistitui os valores ausentes pelos valores anteriores

     a    b  c
0  1.0  5.0  1
1  2.0  5.0  2
2  2.0  5.0  3

In [21]:
#group by

In [22]:
import pandas as pd
# Cria um DataFrame
data = {'Empresa':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Nome':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Venda':[200,120,340,124,243,350]}

In [24]:
df = pd.DataFrame(data)
df

  Empresa     Nome  Venda
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [25]:
group = df.groupby('Empresa')#agrupa dados baesado nos elementos da coluna empresa
group

In [26]:
group.sum()#soma os elementos de Venda onde Empresa tem o mesmo valor
           #ela ignora  a coluna Nome pois os elementos dessa coluna são strings

         Venda
Empresa
FB         593
GOOG       320
MSFT       464

In [27]:
group.mean()#tira a  dos elementos de Venda onde Empresa tem o mesmo valor

         Venda
Empresa
FB       296.5
GOOG     160.0
MSFT     232.0

In [28]:
group.describe() # fala varias informações sobre kda grupo de elementos

        Venda
        count   mean         std    min     25%    50%     75%    max
Empresa
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [29]:
group = df.groupby('Nome')#agrupa dados baesado nos elementos da coluna Nomes
group

In [30]:
group.describe()

        Venda
        count   mean std    min    25%    50%    75%    max
Nome
Amy       1.0  340.0 NaN  340.0  340.0  340.0  340.0  340.0
Carl      1.0  243.0 NaN  243.0  243.0  243.0  243.0  243.0
Charlie   1.0  120.0 NaN  120.0  120.0  120.0  120.0  120.0
Sam       1.0  200.0 NaN  200.0  200.0  200.0  200.0  200.0
Sarah     1.0  350.0 NaN  350.0  350.0  350.0  350.0  350.0
Vanessa   1.0  124.0 NaN  124.0  124.0  124.0  124.0  124.0

In [34]:
df1 = pd.DataFrame({'a': ['A0', 'A1', 'A2', 'A3'],
                        'b': ['B0', 'B1', 'B2', 'B3'],
                        'c': ['C0', 'C1', 'C2', 'C3'],
                        'd': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])
df1

    a   b   c   d
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [35]:
df2 = pd.DataFrame({'a': 'a4 a5 a6 a7'.split(),
                    'b': 'b4 b5 b6 b7'.split(),
                    'c': 'c4 c5 c6 c7'.split(),
                    'd': ['D4', 'D5', 'D6', 'D7']})
df2

    a   b   c   d
0  a4  b4  c4  D4
1  a5  b5  c5  D5
2  a6  b6  c6  D6
3  a7  b7  c7  D7

In [36]:
df3 = pd.DataFrame({'a': 'a8 a9 a10 a11'.split(),
                    'b': 'b8 b9 b10 b11'.split(),
                    'c': 'c8 c9 c10 c11'.split(),
                    'd': ['D8', 'D9', 'D10', 'D11']})
df3

     a    b    c    d
0   a8   b8   c8   D8
1   a9   b9   c9   D9
2  a10  b10  c10  D10
3  a11  b11  c11  D11

In [30]:
pd.concat([df1,df2,df3]) # coloca um Dataframe embaixo do outro (precisam ter os mesmo numero de colunas)

     a    b    c    d
0   A0   B0   C0   D0
1   A1   B1   C1   D1
2   A2   B2   C2   D2
3   A3   B3   C3   D3
0   a4   b4   c4   D4
1   a5   b5   c5   D5
2   a6   b6   c6   D6
3   a7   b7   c7   D7
0   a8   b8   c8   D8
1   a9   b9   c9   D9
2  a10  b10  c10  D10
3  a11  b11  c11  D11

In [38]:
pd.concat([df1,df2,df3], axis=1) # coloca um Dataframe a direita do outro (precisam ter os mesmo numero de linhas)

    a   b   c   d   a   b   c   d    a    b    c    d
0  A0  B0  C0  D0  a4  b4  c4  D4   a8   b8   c8   D8
1  A1  B1  C1  D1  a5  b5  c5  D5   a9   b9   c9   D9
2  A2  B2  C2  D2  a6  b6  c6  D6  a10  b10  c10  D10
3  A3  B3  C3  D3  a7  b7  c7  D7  a11  b11  c11  D11

In [40]:
df1 = pd.DataFrame({'a': ['A0', 'A1', 'A2', 'A3'],
                        'b': ['B0', 'B1', 'B2', 'B3'],
                        'c': ['C0', 'C1', 'C2', 'C3'],
                        'd': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])
df1

     a    b    c    d
0   a8   b8   c8   D8
1   a9   b9   c9   D9
2  a10  b10  c10  D10
3  a11  b11  c11  D11
4  a12  b12  c12  D12

In [45]:
df2 = pd.DataFrame({'a': 'a4 a5 a6 a7'.split(),
                    'b': 'b4 b5 b6 b7'.split(),
                    'c': 'c4 c5 c6 c7'.split(),
                    'd': ['D4', 'D5', 'D6', 'D7']},
                     index=[4,5,6,7])
df2

    a   b   c   d
4  a4  b4  c4  D4
5  a5  b5  c5  D5
6  a6  b6  c6  D6
7  a7  b7  c7  D7

In [46]:
df3 = pd.DataFrame({'a': 'a8 a9 a10 a11'.split(),
                    'b': 'b8 b9 b10 b11'.split(),
                    'c': 'c8 c9 c10 c11'.split(),
                    'd': ['D8', 'D9', 'D10', 'D11']},
                     index=[8,9,10,11])
df3

      a    b    c    d
8    a8   b8   c8   D8
9    a9   b9   c9   D9
10  a10  b10  c10  D10
11  a11  b11  c11  D11

In [47]:
pd.concat([df1,df2,df3], axis=1) # quando os indicies são diferentes o proprio dataframe coloca os indices um embaixo do outro
                                # como df1 não tem elementos após o 3 os valores após esse indice são NaN e o mesmo acontece
                                # com df2 e df3

      a    b    c    d    a    b    c    d    a    b    c    d
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   a4   b4   c4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   a5   b5   c5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   a6   b6   c6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   a7   b7   c7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   a8   b8   c8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   a9   b9   c9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  a10  b10  c10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  a11  b11  c11  D11

In [48]:
esquerda = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
esquerda

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [49]:
direita = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})
direita

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [52]:
pd.merge(esquerda, direita, how='inner', on='key') #junta dataframes que compartilham da coluna key

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [53]:
esquerda = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
direita = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [54]:
esquerda

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [55]:
direita

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [56]:
pd.merge(esquerda, direita, how='inner', on='key1 key2'.split())#junta dataframes que compartilham das coluna key1 e key2

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [57]:
esquerda = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

direita = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [58]:
esquerda

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [59]:
direita

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [63]:
esquerda.join(direita) #junta os dfataframes mas exclui as linhas  que não estão em "esquerda"
                        # como o DF direita não tem a linha k1 aparecem, NaN nas colunas de direita e linhas que eram do DF esquerda

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [62]:
esquerda.join(direita, how='outer') #junta os dfataframes colocando o DF direita à direita

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [2]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [5]:
df['col2'].unique() # retorna um array com os dados da coluna 2 sem considerar as repetições dos elementos
                    # esse metodo não serve em Dataframes, só arrays

array([444, 555, 666], dtype=int64)

In [6]:
df['col2'].nunique() # diz quantos elementos existem na coluna 2 sem considerar as repetições dos elementos
                     # é o len do df['col2'].unique()

3

In [7]:
len(df['col2'].unique())

3

In [10]:
df['col2'].value_counts() # retorna uma series contendo os valores unicos  da coluna 2 e quantas vezes cada um se repete
                          #já vem orndenado pelos que tem maior frequência de repetições

444    2
666    1
555    1
Name: col2, dtype: int64

In [12]:
ndf = df[(df['col1']>2) & (df['col2']==444)] # atribui os valores de df 
                                             #onde a coluna 1 é maior que 2 e a coluna 2 é 444 para ndf
ndf

   col1  col2 col3
3     4   444  xyz

In [13]:
df.sum() # retorna a soma de cada coluna

col1              10
col2            2109
col3    abcdefghixyz
dtype: object

In [15]:
df['col2'].sum() # retorna a soma da coluna 2

2109

In [24]:
def mult(x): # função que multiplica um elemento por 2
    return x*2
df.apply(mult) # aplica a função definida para todos os elementos do

   col1  col2    col3
0     2   888  abcabc
1     4  1110  defdef
2     6  1332  ghighi
3     8   888  xyzxyz

In [25]:
df['col2'].apply(lambda x:x*10)#aplica a função lambda que multiplica um elemento por 10 em todos os elementos da coluna 2

0    4440
1    5550
2    6660
3    4440
Name: col2, dtype: int64

In [26]:
del(df['col2'])#deleta coluna 2
df

   col1 col3
0     1  abc
1     2  def
2     3  ghi
3     4  xyz

In [27]:
df.columns # retorna um array com os nomes das colunas

Index(['col1', 'col3'], dtype='object')

In [28]:
df.index  # retorna um array com os nomes das linhas

RangeIndex(start=0, stop=4, step=1)

In [29]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [30]:
df.sort_values(by='col2') #ordena os valores pela coluna 2
                          #inplace=False

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [31]:
df.isnull() # retorna um DF de tamanho igual ao df 
            #onde se um elemento em df é nulo o seu elemento de mesmo indicie vai ser True
            # e False senão

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [35]:
df = pd.DataFrame({'col1':[1,2,3,np.nan],
                   'col2':[np.nan,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [36]:
df.dropna() #apaga a linha que contém valores NaN
            #axis=0, inplace = False

   col1   col2 col3
1   2.0  555.0  def
2   3.0  666.0  ghi

In [37]:
df.dropna(axis=1) #apaga a coluna que contém os valores NaN

  col3
0  abc
1  def
2  ghi
3  xyz

In [39]:
df.fillna('era nulo') # subsititui os valores nulos por algo (no caos por 'era nulo')
                      #inplace = False

       col1      col2 col3
0       1.0  era nulo  abc
1       2.0     555.0  def
2       3.0     666.0  ghi
3  era nulo     444.0  xyz

In [40]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [42]:
df.pivot_table(values='D',index=['A', 'B'],columns=['C'])#reorganiza as colunas e linhas do dataframe

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN